tracking/twoPhaseBubbleAxisymetric/singlecase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    space
    {
        type            patch;
        nFaces          40;
        startFace       5070;
    }
    freeSurface
    {
        type            patch;
        nFaces          40;
        startFace       5110;
    }
    freeSurfaceShadow
    {
        type            patch;
        nFaces          40;
        startFace       5150;
    }
    axisPlane
    {
        type            patch;
        nFaces          140;
        startFace       5190;
    }
    wedge_pos
    {
        type            patch;
        nFaces          2600;
        startFace       5330;
    }
    wedge_neg
    {
        type            patch;
        nFaces          2600;
        startFace       7930;
    }
)

// ************************************************************************* //
