tracking/twoPhaseBubbleAxisymetric/singlecase/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  interTrackNewtonian;

// values from Pesci 2018: 10.1017/jfm.2018.723

nu [0 2 -1 0 0 0 0] 9.325177981e-7; // 9.3e-4/997.3 = 9,325177981×10⁻⁷; //1e-6
rho [1 -3 0 0 0 0 0] 997.3;

secondaryPhaseNu [0 2 -1 0 0 0 0] 1.83e-5;
secondaryPhaseRho [1 -3 0 0 0 0 0] 1.1965;


sigma [1 0 -2 0 0 0 0] 0.0724;


// ************************************************************************* //
