tracking/twoPhaseBubbleAxisymetric/singlecase/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    space
    {
        type            inletScaledOutletVelocity;
        // type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
    freeSurfaceShadow
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    freeSurface
    {
        type            freeSurfaceVelocity;
        value           uniform (0 0 0);

        nonOrthCorr true;
        fluxCorrected true;
    }
    wedge_pos
    {
        type wedge;
    }
    wedge_neg
    {
        type wedge;
    }
}

// ************************************************************************* //
