tracking/twoPhaseBubbleAxisymetric/singlecase/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    space
    {
        // type extrapolatedPressure;
        type zeroGradient;
        value uniform 0;
    }
    freeSurfaceShadow
    {
        type extrapolatedPressure;
        // type zeroGradient;
        // type fixedFluxExtrapolatedPressure;
        value uniform 0;
    }
    freeSurface
    {
        type freeSurfacePressure;
        pa uniform 0;

        nonOrthCorr true;
    }
    wedge_pos
    {
        type wedge;
    }
    wedge_neg
    {
        type wedge;
    }
}

// ************************************************************************* //
