tracking/twoPhaseBubbleAxisymetric/singlecase/0.orig/c
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      c;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 2e-3; // TODO

referenceLevel  0;

boundaryField
{
    space
    {
        type            zeroGradient; //fixedValue;
        //value           uniform 2e-3; // TODO
    }
    freeSurface
    {
        type            calculated; ///zeroGradient; //fixedValue;
        value           $internalField; // uniform 1;
    }
    wedge_neg
    {
        type            wedge;
    }
    wedge_pos
    {
        type            wedge;
    }
}


// ************************************************************************* //
