tracking/twoPhaseBubbleAxisymetric/singlecase/0.orig/pointMotionU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    location    "0";
    object      pointMotionU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    space
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    freeSurface
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    freeSurfaceShadow
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    wedge_pos
    {
        type wedge;
    }
    wedge_neg
    {
        type wedge;
    }
}


// ************************************************************************* //
