tracking/twoPhaseBubbleAxisymetric/singlecase/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "p|pFinal"
    {
        // solver          PCG;
        // preconditioner  DIC;
        // tolerance       1e-14;
        // relTol          1e-5;


        solver          GAMG;
        tolerance       1e-10;
        relTol          1e-2;
        smoother        GaussSeidel;
        cacheAgglomeration no;
        minIter 1;
    }

    "U|UFinal"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-12;
        relTol          1e-2;
        minIter 1;
    }

    "cellMotionU|cellMotionUFinal"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-12;
        relTol          1e-3;
    }
}

PIMPLE
{
    ddtCorr true;
    correctPhi false;

    nOuterCorrectors    20;
    nCorrectors         3;
    nNonOrthogonalCorrectors 1;

    pRefValue 0;
    // ZT: Required for bubble/droplet ITM case
    pRefPoint (0.0001 0 0);

    moveMeshOuterCorrectors true;

    consistent false;

    residualControl
    {
        U
        {
            relTol 1e-6;
            tolerance 1e-6;
        }
    }

    // ZT: Required for bubble ITM case
    forceSetRef true;
}

relaxationFactors
{
    equations
    {
        "U.*" 0.99;
    }

    fields
    {
        "p.*" 0.99;
    }
}


// ************************************************************************* //
