tracking/twoPhaseBubbleAxisymetric/singlecase/system/finite-area/faMeshDefinition
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faMeshDefinition;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

polyMeshPatches  1( freeSurface );

boundary
{
    wedge_neg
    {
        type newWedge;
        ownerPolyPatch freeSurface;
        neighbourPolyPatch wedge_neg;
    }
    wedge_pos
    {
        type newWedge;
        ownerPolyPatch freeSurface;
        neighbourPolyPatch wedge_pos;
    }
}


// ************************************************************************** //
