tracking/twoPhaseBubbleAxisymetric/singlecase/system/finite-area/faSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      faSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    Cs
    {
        solver          PBiCG;
        preconditioner  DILU;
        minIter         1;
        maxIter         200;
        tolerance       1e-12;
        relTol          1e-2;
    }
}

PISO
{
    nCorrectors                2;
    nNonOrthogonalCorrectors   0;
}

SIMPLE
{
    nTimeCorrectors             6;
    nNonOrthogonalCorrectors    1;
}

relaxationFactors
{
    p               0.7;
    U               0.7;
    k               0.7;
    epsilon         0.7;
    R               0.7;
}


// ************************************************************************* //
