tracking/twoPhaseBubbleAxisymetric/singlecase/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions
#------------------------------------------------------------------------------

printHelp() {
    cat<<USAGE

usage: ${0##*/} [OPTION]

options:
    -parallel           Run one simulation in a parallel manner
    -help               Print the usage

USAGE
    exit 0 # A clean exit
}

# Report error and exit
die()
{
    exec 1>&2
    echo
    echo "Error encountered:"
    while [ "$#" -ge 1 ]; do echo "    $1"; shift; done
    echo
    echo "See '${0##*/} -help' for usage"
    echo
    exit 1
}


# Set default(s)
# Run simulation in a parallel manner
parallel=false


# Parse input options
while [ "$#" -gt 0 ]
do
    case "$1" in
    -h* | -help*)   printHelp ;;
    # -with-bear)
    #     WITH_BEAR="-with-bear"
    #     ;;
    -parallel)
        parallel=true
        echo "Set execution to parallel."
        ;;
    *)
        die "Unknown option/argument: '$1'"
        ;;
    esac
    shift
done


restore0Dir

m4 < ./system/blockMeshDict.m4 > ./system/blockMeshDict
runApplication blockMesh

runApplication wedgeFrom2D -angle 2

runApplication topoSet
runApplication collapseEdges -collapseFaceSet collapseFaces -overwrite

runApplication createPatch -overwrite
runApplication changeDictionary

runApplication makeFaMesh
runApplication checkMesh -allTopology -allGeometry


if [ "$parallel" = true ] ; then
    echo "Chosen parallel execution."
    runApplication writePhaseFraction
    runApplication decomposePar
    runParallel $(getApplication)
    # runApplication reconstructPar
else
    echo "Chosen serial execution."
    runApplication $(getApplication)
fi


##jupyter nbconvert --to notebook --inplace --execute plotOverTime.ipynb
jupyter nbconvert plotOverTime.ipynb --execute --to markdown

if [ "$(cat result.txt)" = "true" ]; then echo "Result could be ok!"; fi
if [ "$(cat result.txt)" != "true" ]; then exit 1; fi

#------------------------------------------------------------------------------
